docs/2015/S-username-must-have-mode-700.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2021-08-30 Mon 16:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-username must have mode 700.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="clothoid" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">S-username must have mode 700.</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4e7a76e">1. エラー</a></li>
<li><a href="#orga0ce0cd">2. 原因</a></li>
<li><a href="#org47ecb30">3. 対処方法</a></li>
<li><a href="#orgf7b1e37">4. 環境</a></li>
<li><a href="#org68fa769">5. 参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4e7a76e" class="outline-2">
<h2 id="org4e7a76e"><span class="section-number-2">1</span> エラー</h2>
<div class="outline-text-2" id="text-1">
<p>
screen をインストールし、実行すると以下のエラーが出る
</p>
<pre class="example">
# apt-cyg install screen
# screen
Directory /tmp/uscreens/S-username must have mode 700.
</pre>
</div>
</div>
<div id="outline-container-orga0ce0cd" class="outline-2">
<h2 id="orga0ce0cd"><span class="section-number-2">2</span> 原因</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://gist.github.com/pasela/3401354">screen-4.1.0-cygwin-sock-permission.patch</a> が反映されていない。
</p>
</div>
</div>
<div id="outline-container-org47ecb30" class="outline-2">
<h2 id="org47ecb30"><span class="section-number-2">3</span> 対処方法</h2>
<div class="outline-text-2" id="text-3">
<p>
screen v4.2.1 <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> をソースから持ってきて、screen-4.1.0-cygwin-sock-permission.patch を当てて、インストールする。
</p>
<pre class="example">
# apt-cyg install gcc4 autoconf automake libncurses-devel
# mkdir ~/tmp
# cd ~/tmp
# wget http://git.savannah.gnu.org/cgit/screen.git/snapshot/v.4.2.1.tar.gz
# tar xzvf v.4.2.1.tar.gz
# cd v.4.2.1/patches
# wget https://gist.githubusercontent.com/pasela/3401354/raw/4357422e6589ed2bef5a40deb9244ae05ab7057a/screen-4.1.0-cygwin-sock-permission.patch
# cd ~/tmp/v.4.2.1/src
# patch -u screen.c &lt; ../patches/screen-4.1.0-cygwin-sock-permission.patch
# ./autogen.sh
# ./configure --enable-colors256
# cp Makefile Makefile.orig
# emacs -Q Makefile
# diff Makefile.orig Makefile
89c89
&lt;       -chown root $(DESTDIR)$(bindir)/$(SCREEN) &amp;&amp; chmod 4755 $(DESTDIR)$(bindir)/$(SCREEN)
---
&gt;       -chown username $(DESTDIR)$(bindir)/$(SCREEN) &amp;&amp; chmod 4755 $(DESTDIR)$(bindir)/$(SCREEN)
# mkdir /usr/lib/terminfo/s
# cp ./terminfo/screencap /usr/lib/terminfo/s/
# make
# make install
# screen -v
Screen version 4.02.01 (GNU) 28-Apr-14
# screen
</pre>
</div>
</div>
<div id="outline-container-orgf7b1e37" class="outline-2">
<h2 id="orgf7b1e37"><span class="section-number-2">4</span> 環境</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Windows 7 64bit</li>
<li>gnupack<sub>devel</sub>-13.06-2015.11.08</li>
<li>Screen version 4.03.01 (GNU) 28-Jun-15</li>
</ul>
</div>
</div>

<div id="outline-container-org68fa769" class="outline-2">
<h2 id="org68fa769"><span class="section-number-2">5</span> 参考</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://gist.github.com/pasela/3401354">GNU screen: A patch to avoid /tmp/uscreens permission check on Cygwin</a></li>
<li><a href="http://tu3.jp/01012">Windows 8.1 の cygwin で group の permission が設定できない。</a></li>
<li><a href="http://taquet.air-nifty.com/blog/2014/01/cygwinscreenper.html">【 Cygwin/GNU screen 】 permission 問題とりあえず解決。</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
最新の v4.3.1 だと make で以下のように出力され失敗する(解決方法不明)。
</p>

<pre class="example">
utmp.c:634:4: エラー: ‘ struct utmp ’ は ‘ ut_tv ’ という名前のメンバを持っていません
 u-&gt;ut_tv.tv_sec = now;
  ^
Makefile:82: ターゲット 'utmp.o' のレシピで失敗しました
make: *** [utmp.o] エラー 1
</pre></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2021-08-30 Mon 16:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
